package com.example.memorizy.domain.text_comparison.algorithm

// Обработанное множество русских стоп-слов
// https://github.com/stopwords-iso/stopwords-ru

object RussianStopWords {

    val words: Set<String> = setOf(
        "c", "а", "будем", "будет", "будете", "будешь", "будто", "буду", "будут",
        "будь", "бы", "был", "была", "были", "было", "быть",
        "в", "вам", "вами", "вас", "ваш", "ваша", "ваше", "ваши", "ведь", "весь",
        "вне", "во", "вон", "вообще", "вот", "впрочем",
        "все", "всегда", "всего", "всем", "всеми", "всему", "всех", "всею", "всю", "всюду", "вся", "всё",
        "вы", "где", "да", "даже", "для", "до",
        "его", "ее", "ей", "ему", "еще", "ещё", "ею", "её",
        "ж", "же", "за", "затем", "зато", "зачем", "здесь",
        "и", "из", "им", "ими", "их",
        "к", "как", "какая", "какой", "кем", "когда", "кого", "ком", "кому",
        "которая", "которого", "которой", "которые", "который", "которых",
        "кто", "куда",
        "ли", "между", "меня", "мне", "мной", "мною",
        "мои", "мой", "моя", "моё", "мы",
        "на", "над", "надо", "наконец",
        "нам", "нами", "нас", "наш", "наша", "наше", "наши",
        "него", "нее", "ней", "некоторый", "нем", "нему",
        "нею", "неё",
        "нибудь",
        "ним", "ними", "них",
        "ну", "нужно",
        "о", "об", "оба", "около", "он", "она", "они", "оно",
        "опять", "от", "откуда", "отовсюду", "отсюда",
        "перед", "по", "под", "пожалуйста", "пока", "после", "посреди",
        "потом", "потому", "почему", "при", "про", "просто",
        "с", "сам", "сама", "сами", "самим", "самими", "самих", "само",
        "самого", "самой", "самом", "самому", "саму",
        "свое", "своего", "своей", "свои", "своих", "свой", "свою",
        "себе", "себя", "сих", "сколько", "со", "собой", "собою", "совсем",
        "та", "так", "такая", "также", "таки", "такие", "такое", "такой", "там",
        "твои", "твой", "твоя", "твоё",
        "те", "тебе", "тебя", "тем", "теми", "теперь", "тех",
        "то", "тобой", "тобою", "тогда", "того", "тоже", "том", "тому", "тот", "тою",
        "ту", "туда", "тут", "ты",
        "у", "уж", "уже",
        "чего", "чем", "чему", "через", "что", "чтоб", "чтобы", "чуть",
        "эта", "эти", "этим", "этими", "этих", "это", "этого", "этой", "этом", "этому", "этот", "эту",
        "я"
    )

    fun isStopWord(word: String): Boolean = word in words
}